# Intro to Pandas

|  | Tuesday 4-5:15pm | Friday  4-5:30pm |
|:------:|:-------------------------------------------:|:--------------------------------------------------------------------------:|
| **Week 1** | Introduction | Introduction |
| **Week 2** | Custom computer vision tasks | State of the art in Computer Vision |
| **Week 3** | Introduction to Tabular modeling and pandas | **Pandas workshop and feature engineering** |
| **Week 4** | Tabular and Image Regression | Feature importance and advanced feature  engineering |
| **Week 5** | Natural Language Processing | State of the art in NLP |
| **Week 6** | Segmentation and Kaggle | Audio |
| **Week 7** | Computer vision from scratch | NLP from scratch |
| **Week 8** | Callbacks | Optimizers |
| **Week 9** | Generative Adversarial Networks | Research time / presentations |
| **Week 10** | Putting models into production | Putting models into production |

Today we will look at Pandas from the Titanic dataset. We will do some variable generation, an dlook at the basic functionalities available in the Pandas library

In [0]:
!git clone https://github.com/pcsanwald/kaggle-titanic.git

Cloning into 'kaggle-titanic'...
remote: Enumerating objects: 19, done.
remote: Counting objects: 100% (19/19), done.
remote: Compressing objects: 100% (13/13), done.
remote: Total 19 (delta 0), reused 19 (delta 0), pack-reused 0
Unpacking objects: 100% (19/19), done.

In [0]:
import pandas as pd
from fastai.basic_data import pathlib

In [0]:
path = pathlib.Path('kaggle-titanic/')

In [0]:
path.ls()

[PosixPath('kaggle-titanic/.gitignore'),
 PosixPath('kaggle-titanic/src'),
 PosixPath('kaggle-titanic/test'),
 PosixPath('kaggle-titanic/train.csv'),
 PosixPath('kaggle-titanic/test.csv'),
 PosixPath('kaggle-titanic/project.clj'),
 PosixPath('kaggle-titanic/README.md'),
 PosixPath('kaggle-titanic/doc'),
 PosixPath('kaggle-titanic/.git')]

First let's open the train.csv. Pandas uses `read_` to turn data into a dataframe, and you can use many different filetypes!

In [0]:
df = pd.read_csv(path/'train.csv')

Now let's go over a few different key commands you need to know.

## Head and Tail

In [0]:
df.head()

   survived  pclass  ... cabin embarked
0         0       3  ...   NaN        S
1         1       1  ...   C85        C
2         1       3  ...   NaN        S
3         1       1  ...  C123        S
4         0       3  ...   NaN        S

[5 rows x 11 columns]

In [0]:
df.tail()

     survived  pclass  ... cabin embarked
886         0       2  ...   NaN        S
887         1       1  ...   B42        S
888         0       3  ...   NaN        S
889         1       1  ...  C148        C
890         0       3  ...   NaN        Q

[5 rows x 11 columns]

## Iloc vs Loc

`loc`: is used to get rows (or columns) with particular *labels* from an index

`iloc`: is used to get rows (or columns) in a *position* from an index

`ix`: behaves like `loc`, but if a label is not present in the index, will rever to `iloc` -> **This is depreciated**

To illustrate this, we will look at the first 3 rows

In [0]:
df.iloc[:3]

   survived  pclass  ... cabin embarked
0         0       3  ...   NaN        S
1         1       1  ...   C85        C
2         1       3  ...   NaN        S

[3 rows x 11 columns]

In [0]:
df.loc[:3]

   survived  pclass  ... cabin embarked
0         0       3  ...   NaN        S
1         1       1  ...   C85        C
2         1       3  ...   NaN        S
3         1       1  ...  C123        S

[4 rows x 11 columns]

Loc we get labels 0,1,2,3 *not* the first three rows as expected. Notice this difference

# Selecting

We can select from a variety of different options, row, value, even via a column.

## Row Based

In [0]:
df.iloc[12]

survived                                 0
pclass                                   3
name        Saundercock, Mr. William Henry
sex                                   male
age                                     20
sibsp                                    0
parch                                    0
ticket                           A/5. 2151
fare                                  8.05
cabin                                  NaN
embarked                                 S
Name: 12, dtype: object

## Column Based

In [0]:
df['survived'].head()

0    0
1    1
2    1
3    1
4    0
Name: survived, dtype: int64

In [0]:
df[['sex', 'age', 'survived']].iloc[:5]

      sex   age  survived
0    male  22.0         0
1  female  38.0         1
2  female  26.0         1
3  female  35.0         1
4    male  35.0         0

## Value Based

In [0]:
df.loc[df['column_name'] == some_value]

In [0]:
df.loc[df['sex'] == 'female'].head()

   survived  pclass  ... cabin embarked
1         1       1  ...   C85        C
2         1       3  ...   NaN        S
3         1       1  ...  C123        S
8         1       3  ...   NaN        S
9         1       2  ...   NaN        C

[5 rows x 11 columns]

In [0]:
df.loc[(df['sex'] == 'female') & (df['survived'] == 0)].head()

    survived  pclass  ... cabin embarked
14         0       3  ...   NaN        S
18         0       3  ...   NaN        S
24         0       3  ...   NaN        S
38         0       3  ...   NaN        S
40         0       3  ...   NaN        S

[5 rows x 11 columns]

# Analyzing Missing Values

In [0]:
df.isna().head()

   survived  pclass   name    sex    age  ...  parch  ticket   fare  cabin  embarked
0     False   False  False  False  False  ...  False   False  False   True     False
1     False   False  False  False  False  ...  False   False  False  False     False
2     False   False  False  False  False  ...  False   False  False   True     False
3     False   False  False  False  False  ...  False   False  False  False     False
4     False   False  False  False  False  ...  False   False  False   True     False

[5 rows x 11 columns]

In [0]:
df.isna().sum()

survived      0
pclass        0
name          0
sex           0
age         177
sibsp         0
parch         0
ticket        0
fare          0
cabin       687
embarked      2
dtype: int64

In [0]:
sum(df.isna().sum())

866

In [0]:
df.loc[df['survived'].isna() == True]

Empty DataFrame
Columns: [survived, pclass, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked]
Index: []

In [0]:
df.loc[df['survived'].isna() == False].head()

   survived  pclass  ... cabin embarked
0         0       3  ...   NaN        S
1         1       1  ...   C85        C
2         1       3  ...   NaN        S
3         1       1  ...  C123        S
4         0       3  ...   NaN        S

[5 rows x 11 columns]

In [0]:
len(df.loc[df['cabin'].isna() == True]), len(df)

(687, 891)

# Adding or removing rows and columns

## Removing via Value Selection

In [0]:
surv = df[df['survived'] == True]

In [0]:
dead = df[df['survived'] == False]

In [0]:
len(surv), len(dead)

(342, 549)

## Removing by row index

In [0]:
df.iloc[2]

survived                         1
pclass                           3
name        Heikkinen, Miss. Laina
sex                         female
age                             26
sibsp                            0
parch                            0
ticket            STON/O2. 3101282
fare                         7.925
cabin                          NaN
embarked                         S
Name: 2, dtype: object

In [0]:
df.index[2]

3

In [0]:
df.drop(df.index[2], inplace=True)

In [0]:
df.iloc[2]

survived                           0
pclass                             3
name        Allen, Mr. William Henry
sex                             male
age                               35
sibsp                              0
parch                              0
ticket                        373450
fare                            8.05
cabin                            NaN
embarked                           S
Name: 4, dtype: object

## Adding via row index

In [0]:
len(df)

889

In [0]:
df.iloc[889]

IndexError: ignored

In [0]:
df.loc[891] = ['0', '3', 'Mueller, Zach', 'robot', '21', '0', '0', '123456', '12.00', 'NaN', 'C']

In [0]:
df.iloc[889]

survived                0
pclass                  3
name        Mueller, Zach
sex                 robot
age                    21
sibsp                   0
parch                   0
ticket             123456
fare                12.00
cabin                 NaN
embarked                C
Name: 891, dtype: object

In [0]:
df.iloc[890] = ['0', '3', 'Mueller, Zach', 'robot', '21', '0', '0', '123456', '12.00', 'NaN', 'C']

IndexError: ignored

# Feature Engineering

Feature engineering is creating new features from old ones.

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
survived    891 non-null category
pclass      891 non-null int64
name        891 non-null category
sex         891 non-null category
age         714 non-null float64
sibsp       891 non-null int64
parch       891 non-null int64
ticket      891 non-null category
fare        891 non-null float64
cabin       204 non-null category
embarked    889 non-null category
dtypes: category(6), float64(2), int64(3)
memory usage: 121.4 KB

In [0]:
df['name'].tail()

886                       Montvila, Rev. Juozas
887                Graham, Miss. Margaret Edith
888    Johnston, Miss. Catherine Helen "Carrie"
889                       Behr, Mr. Karl Howell
890                         Dooley, Mr. Patrick
Name: name, dtype: category
Categories (891, object): [Abbing, Mr. Anthony, Abbott, Mr. Rossmore Edward,
                           Abbott, Mrs. Stanton (Rosa Hunt), Abelson, Mr. Samuel, ..., de Pelsmaeker, Mr. Alfons,
                           del Carlo, Mr. Sebastiano, van Billiard, Mr. Austin Blyler,
                           van Melkebeke, Mr. Philemon]

Why is this important? Titles. 'Mr.', 'Miss', 'Rev'

Let's store these into a new column called 'Title', and use a regular expression to extract it.

In [0]:
import re

In [0]:
df['Title'] = df['name'].apply(lambda x: re.search(' ([A-Z][a-z]+)\.', x).group(1))

In [0]:
df['Title'].head()

0      Mr
1     Mrs
2    Miss
3     Mrs
4      Mr
Name: Title, dtype: object

In [0]:
df.head()

   survived  pclass  ... embarked Title
0         0       3  ...        S    Mr
1         1       1  ...        C   Mrs
2         1       3  ...        S  Miss
3         1       1  ...        S   Mrs
4         0       3  ...        S    Mr

[5 rows x 12 columns]

In [0]:
df['Title'].nunique()

17

In [0]:
df['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms', 'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt',
       'Countess', 'Jonkheer'], dtype=object)

Let's go ahead and switch 'Mlle' and 'Ms' with 'Miss', and 'Mme' with 'Mrs' as they are french titles. We will replace this via what is called a 'dictionary'

In [0]:
myDict = {'Mlle': 'Miss', 'Ms':'Miss', 'Mme':'Mrs'}

In [0]:
df['Title'] = df['Title'].replace(myDict)

In [0]:
df['Title'].nunique(), df['Title'].unique()

(14,
 array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Major', 'Lady', 'Sir', 'Col', 'Capt', 'Countess',
        'Jonkheer'], dtype=object))

We can also switch anything 'abnormal' with a 'special' column

In [0]:
special = ['Don', 'Rev', 'Dr', 'Major', 'Lady', 'Sir', 'Col', 
          'Capt', 'Countess', 'Jonkheer']

In [0]:
df['Title'] = df['Title'].replace(special, 'Special')

In [0]:
df['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Special'], dtype=object)

In [0]:
df.tail()

     survived  pclass  ... embarked    Title
886         0       2  ...        S  Special
887         1       1  ...        S     Miss
888         0       3  ...        S     Miss
889         1       1  ...        C       Mr
890         0       3  ...        Q       Mr

[5 rows x 12 columns]

## Missing Values ourselves

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
survived    891 non-null int64
pclass      891 non-null int64
name        891 non-null object
sex         891 non-null object
age         714 non-null float64
sibsp       891 non-null int64
parch       891 non-null int64
ticket      891 non-null object
fare        891 non-null float64
cabin       204 non-null object
embarked    889 non-null object
Title       891 non-null object
dtypes: float64(2), int64(4), object(6)
memory usage: 83.6+ KB

`age`, `cabin`, and `embarked` all have missing values. We can deal with this by either the mean or the median. We'll do the median. We can use `.fillna()` to assist with this faster.

We first need to make a new column to remember what ones were and were not null, and we can use the ~ to select if there is a value *at all* there

In [0]:
df['Has_Cabin'] = ~df['cabin'].isnull()
df['Has_Age']= ~df['age'].isnull()
df['Has_Embarked'] = ~df['embarked'].isnull()

In [0]:
df.head()

   survived  pclass  ... Has_Age Has_Embarked
0         0       3  ...    True         True
1         1       1  ...    True         True
2         1       3  ...    True         True
3         1       1  ...    True         True
4         0       3  ...    True         True

[5 rows x 15 columns]

In [0]:
df['age'] = df['age'].fillna(df['age'].mean())
df['embarked'] = df['embarked'].fillna('S')

In [0]:
df.head()

   survived  pclass  ... Has_Age Has_Embarked
0         0       3  ...    True         True
1         1       1  ...    True         True
2         1       3  ...    True         True
3         1       1  ...    True         True
4         0       3  ...    True         True

[5 rows x 15 columns]

## Binning Data

This is done to numerical columns, we group via ranges of values, and this is determinate of the individual row itself

In [0]:
df['age'].min(), df['age'].max()

(0.42, 80.0)

We will use `qcut` to bucketize them, we pass in a column, the buckets, and if we want to encode the lables as numbers, we set `labels` to `False`.

In [0]:
df['BuckAge'] = pd.qcut(df['age'], q=4, labels=False)

In [0]:
df[['age', 'BuckAge']].head()

    age  BuckAge
0  22.0        0
1  38.0        3
2  26.0        1
3  35.0        2
4  35.0        2

With this we can now safely drop `Age`

In [0]:
df = df.drop(['age'], axis=1)

In [0]:
df.head()

   survived  pclass  ... Has_Embarked BuckAge
0         0       3  ...         True       0
1         1       1  ...         True       3
2         1       3  ...         True       1
3         1       1  ...         True       2
4         0       3  ...         True       2

[5 rows x 15 columns]

# train_test_split

In [0]:
from sklearn.model_selection import train_test_split

In [0]:
train, test = train_test_split(df, test_size=0.1)

In [0]:
len(df), len(train), len(test)

(891, 801, 90)

In [0]:
df.head()

   survived  pclass  ... Has_Embarked BuckAge
0         0       3  ...         True       0
1         1       1  ...         True       3
2         1       3  ...         True       1
3         1       1  ...         True       2
4         0       3  ...         True       2

[5 rows x 15 columns]

In [0]:
train.head()

     survived  pclass  ... Has_Embarked BuckAge
100         0       3  ...         True       1
106         1       3  ...         True       0
565         0       3  ...         True       1
528         0       3  ...         True       3
48          0       3  ...         True       1

[5 rows x 15 columns]

In [0]:
test.head()

     survived  pclass  ... Has_Embarked BuckAge
558         1       1  ...         True       3
762         1       3  ...         True       0
297         0       1  ...         True       0
158         0       3  ...         True       1
116         0       3  ...         True       3

[5 rows x 15 columns]